In [1]:
import mysql.connector

In [14]:
db = mysql.connector.connect(
    host= 'localhost',
    user = 'root',
    password ='dev123'
)

In [15]:
if db:
    print("Connection successful!")

Connection successful!

In [40]:
c = db.cursor()

In [8]:
c.execute("CREATE DATABASE PYTHONMYSQL24")

In [17]:
# Executing SQL query to get all databases
c.execute("SHOW DATABASES")

In [18]:
for database in c: 
    print (database)

('information_schema',)
('myfirstdb',)
('mysql',)
('ngenodb',)
('performance_schema',)
('pythonmysql24',)
('sys',)

In [19]:
c.execute("USE pythonmysql24")

In [20]:
c.execute("CREATE TABLE employees (id INT AUTO_INCREMENT PRIMARY KEY, EmployeeNo Varchar(255), FirstName Varchar(255), LastName Varchar(255), Age INT, Role Varchar(50))")

In [28]:
c.execute("SHOW tables")

In [29]:
for table in c:
    print(table)

('departments',)
('employees',)

In [23]:
c.execute("ALTER TABLE employees ADD Column Phone varChar(255)")

In [24]:
c.execute("CREATE TABLE Departments (id INT AUTO_INCREMENT PRIMARY KEY, name varChar(255), Head INT, FOREIGN KEY (Head) REFERENCES employees(id))")

In [26]:
c.execute("ALTER TABLE employees ADD COLUMN DepartmentID INT")

In [27]:
c.execute("ALTER TABLE employees ADD FOREIGN KEY (DepartmentID) REFERENCES departments(id)")

In [30]:
c.execute("SELECT * FROM employees")

In [31]:
for row in c:
    print(row)

In [32]:
c.execute("INSERT INTO Departments (name) VALUES ('Human Resources'), ('Engineering'), ('Marketing')")

In [44]:
sql = "INSERT INTO employees (EmployeeNo, FirstName, LastName, DepartmentID,Age, Phone ) VALUES (%s,%s, %s, %s, %s, %s)"
val= ('101', 'Roy', 'Kiprop',1,22,'70043234')
c.execute(sql,val)

#Commit Changes to DB

db.commit()

print(c.rowcount, "rows affected.")

In [48]:
sql = "INSERT INTO employees (EmployeeNo, FirstName, LastName, DepartmentID,Age, Phone ) VALUES (%s,%s, %s, %s, %s, %s)"
vals= [

    ('102', 'Brigit', 'Ngen0',1,22,'7004356234'),
    ('103', 'Victor', 'Ngeno',2,27,'7004634'),
    ('104', 'Maria', 'Cheptoo',3,5,'700436234'),
    ('105', 'Brian', 'Kibet',2,1,'700432634')
      ]
c.executemany(sql,vals)

#Commit Changes to DB

db.commit()

print(c.rowcount, "rows affected.")

4 rows affected.

In [51]:
# SELECT

q = "SELECT * FROM employees"
c.execute(q)

#Fetch Values

result = c.fetchall()

#Print one by one

for row in result:
    print(row)

(1, '55', 'Roy', 'Kiprop', 22, None, '43234', 1)
(2, '55', 'Roy', 'Kiprop', 22, None, '43234', 1)
(3, '101', 'Roy', 'Kiprop', 22, None, '70043234', 1)
(4, '101', 'Roy', 'Kiprop', 22, None, '70043234', 1)
(5, '101', 'Roy', 'Kiprop', 22, None, '70043234', 1)
(6, '102', 'Brigit', 'Ngen0', 22, None, '7004356234', 1)
(7, '103', 'Victor', 'Ngeno', 27, None, '7004634', 2)
(8, '104', 'Maria', 'Cheptoo', 5, None, '700436234', 3)
(9, '105', 'Brian', 'Kibet', 1, None, '700432634', 2)
(10, '102', 'Brigit', 'Ngen0', 22, None, '7004356234', 1)
(11, '103', 'Victor', 'Ngeno', 27, None, '7004634', 2)
(12, '104', 'Maria', 'Cheptoo', 5, None, '700436234', 3)
(13, '105', 'Brian', 'Kibet', 1, None, '700432634', 2)

In [52]:
# SELECT SEPCI

q = "SELECT FirstName, Age  FROM employees"
c.execute(q)

#Fetch Values

result = c.fetchall()

#Print one by one

for row in result:
    print(row)

('Roy', 22)
('Roy', 22)
('Roy', 22)
('Roy', 22)
('Roy', 22)
('Brigit', 22)
('Victor', 27)
('Maria', 5)
('Brian', 1)
('Brigit', 22)
('Victor', 27)
('Maria', 5)
('Brian', 1)

In [63]:
# SELECT WHERE / ORDER / LIMIT

q = "SELECT FirstName, Age  FROM employees WHERE Age <26  ORDER BY FirstName DESC LIMIT 2"
c.execute(q)

#Fetch Values

result = c.fetchall()

#Print one by one

for row in result:
    print(row)

('Roy', 22)
('Roy', 22)

In [56]:
# DELETE 
# SELECT WHERE / ORDER

q = "DELETE  FROM employees WHERE Age <5"
c.execute(q)

print(c.rowcount, "rows affected.")

2 rows affected.

In [59]:
# UPDATE 

q = "UPDATE employees SET Age = 25 WHERE Age =5"
c.execute(q)

print(c.rowcount, "rows affected.")

2 rows affected.

In [68]:
# JOINS - Get employees from Marketing  - LEFT JOIN, RIGHT JOIN 

q = "SELECT employees.FirstName, Departments.name  FROM employees INNER JOIN Departments ON  employees.DepartmentID=Departments.id ORDER BY FirstName ASC"
c.execute(q)

#Fetch Values

result = c.fetchall()

#Print one by one

for row in result:
    print(row)

('Brigit', 'Human Resources')
('Brigit', 'Human Resources')
('Maria', 'Marketing')
('Maria', 'Marketing')
('Roy', 'Human Resources')
('Roy', 'Human Resources')
('Roy', 'Human Resources')
('Roy', 'Human Resources')
('Roy', 'Human Resources')
('Victor', 'Engineering')
('Victor', 'Engineering')